In [7]:
import pandas as pd

In [8]:
import numpy as np

In [11]:
df = pd.DataFrame(np.arange(0,20).reshape(5,4),index=['r1','r2','r3','r4','r5'],columns=['c1','c2','c3','c4'])  #create dataframe

In [12]:
df

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [20]:
df.shape

(5, 4)

In [21]:
df.size

20

In [23]:
df.head()

    c1  c2  c3  c4
r1   0   1   2   3
r2   4   5   6   7
r3   8   9  10  11
r4  12  13  14  15
r5  16  17  18  19

In [24]:
df.to_csv('test1.csv')  #converting dataframe to csv

In [13]:
df['c1']

r1     0
r2     4
r3     8
r4    12
r5    16
Name: c1, dtype: int64

In [15]:
df.c1

r1     0
r2     4
r3     8
r4    12
r5    16
Name: c1, dtype: int64

In [34]:
df['c1'].values        #converting series to array

array([ 0,  4,  8, 12, 16])

In [36]:
df['c1'].value_counts()      #value count per element

12    1
4     1
16    1
8     1
0     1
Name: c1, dtype: int64

In [38]:
df['c2'].unique()

array([ 1,  5,  9, 13, 17])

In [32]:
df.iloc[:5,:3]

    c1  c2  c3
r1   0   1   2
r2   4   5   6
r3   8   9  10
r4  12  13  14
r5  16  17  18

In [31]:
df.loc['r4']

c1    12
c2    13
c3    14
c4    15
Name: r4, dtype: int64

In [40]:
df[['c2','c3']]

    c2  c3
r1   1   2
r2   5   6
r3   9  10
r4  13  14
r5  17  18

In [50]:
df=pd.read_csv('tags.csv',sep=',')

In [51]:
df.head()

   userId  movieId           tag   timestamp
0      19     2324   bittersweet  1428651158
1      19     2324     holocaust  1428651112
2      19     2324  World War II  1428651118
3      23     7075     hilarious  1378675786
4      23     7075    Underrated  1378675786

In [52]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 586994 entries, 0 to 586993
Data columns (total 4 columns):
 #   Column     Non-Null Count   Dtype
---  ------     --------------   -----
 0   userId     586994 non-null  int64
 1   movieId    586994 non-null  int64
 2   tag        586978 non-null  object
 3   timestamp  586994 non-null  int64
dtypes: int64(3), object(1)
memory usage: 17.9+ MB

In [53]:
df.describe()

              userId        movieId     timestamp
count  586994.000000  586994.000000  5.869940e+05
mean   121879.883692   35625.951965  1.326915e+09
std     70876.787987   39546.008522  9.157449e+07
min        19.000000       1.000000  1.135429e+09
25%     54403.000000    2467.000000  1.253922e+09
50%    124117.000000    7649.000000  1.331483e+09
75%    182502.000000   68319.000000  1.416526e+09
max    247753.000000  151701.000000  1.454054e+09

In [54]:
df['userId'].value_counts()

32298     20741
114930    13793
137059    10665
184862    10084
46311      9011
          ...
185084        1
84451         1
145054        1
55899         1
24638         1
Name: userId, Length: 15357, dtype: int64